loadtest/ext_loadtest.yml
execution:
- executor: locust
  concurrency: 100
  ramp-up: 30s
  hold-for: 1m
  scenario: loadtest

scenarios:
  loadtest:
    default-address: http://localhost:8080
    script: ext_loadtest.py

modules:
 console:
   disable: true 

# reporting:
#   - module: passfail
#     criteria:
#       - avg-rt > 1s for 10s, stop as non-failed
#       - p90 > 2s for 10s, stop as non-failed
#       - success < 100% for 10s, stop as failed